#include <stdio.h>
#include <stdlib.h>
#include <stdio.h>
#include <stdlib.h>
/*פיבונאצי
פונקציה שמקבלת מספר אן ומחשבת את האיבר האןי בסדת פיבונאצי 
פיבונאצי מתחילה מאיבר אפס שווה ל-0 מאיבר 1 שווה ששווה ל1 ומגזידרה את האיבר
האן להיות סכום של שני האיברים הקודמים לו
*/
/*הסבר לפונקציה
יש לנו במקרה הזה שני מקרי בסיס גם עבור 0 וגם עבור 1 
כי הצעד של הריקורסיה מוגדר מאן של 2 ומעלה*/
int fibonacci(int n){
    if(n==0){
        return 0;
    }
    if(n==1){
        return 1;
    }
    return fibonacci(n-1) + fibonacci(n-2);
}


int main(){
    return 0;
}