#include <stdio.h>
#include <stdlib.h>
#include <stdio.h>
#include <stdlib.h>
// דוגמא עבור פונקציה שמדפיסה משולש של כוכבים בגובה א שורות
/*for n 4
*
**
***
****
*/
void triangle(int n){
    if(n<=0){
        return;
    }
    triangle(n-1);
    for(int i=0;i<n;i++){
        putchar('*');
    }
    putchar('\n');
}
/*for n 4
****
***
**
*
*/
void triangle_up(int n){
    if(n<=0){
        return;
    }
    for(int i=0;i<n;++i){
        putchar('*');
    }
    putchar('\n');
    triangle_up(n-1);
}

int main(){
    // triangle(4);
    // triangle_up(4);
    return 0;
}
/*רקורסיה אולגריתם
.......... 
מקרה בסיסי
..........
זהו המקרה בקצה השרשרת הרקורסיבית בו הפתרון לבעיה כבר ידוע ואי צורך
לפרק את הבעיה לתתי בעיות
.........
צעד מעבר
.........
זהו האופן בו מפרקים את הבעיה הנתונה לתתי בעיות זהות אך פשוטות יותר
ולאחר מכן בונים מהפתרונות שלהן את הפתרון של הבעיה המקורית
*/

/*גישה כללי לפתרון רקורסיה
................
בהינתן בעיה שרוצים לפתור
((1))
מצא דרך להקטין את הבעיה 
((2))
הנח שהפונקציה יודעת לפתור את הבעיה המוקטנת
((3))
מצב דרך לפתור את הבעיה הגדולה על ידיד שימוש בפתרון של הבעיה המוקטנת 
זה יהיה צעד של הרקורסיה
((4))
מצב מהי הבעיה המוקטנת שאנחנו יודעים את הפתרון שלה
זה יהיה תנאי העצירה
*/
